Repository: DBinaghi/plugin-SimplePages
Catalog: languages/*.po
Languages: cy_gb

source: Simple Pages
cy_gb: Tudalennau Syml

source: Simple Page
cy_gb: Tudalen Syml

source: Filter User Input For Page Content?
cy_gb: Hidlo Mewnbwn Defnyddiwr ar gyfer Cynnwys Tudalen?

source: If checked, this plugin will filter all simple pages using the HTML filters set on the security settings page. PHP code will not be allowed in the content of pages if this box is checked.
cy_gb: Wrth dicio'r blwch, bydd yr ategyn yn hidlo pob tudalen syml yn defnyddio'r hidlyddion HTML o'r dudalen gosodiadau diogelwch. Ni fydd côd PHP yn cael ei ganiatáu yng nghynnwys y tudalennau os yw'r blwch yma wedi ei dicio.

source: Name and heading for the page (required)
cy_gb: Enw a phennawd i'r tudalen (gofynnol)

source: The slug is the part of the URL for this page. A slug will be created automatically from the title if one is not entered. Letters, numbers, underscores, dashes, and forward slashes are allowed.
cy_gb: Mae'r 'slug' yn rhan o URL y dudalen hon. Bydd 'slug' yn cael ei greu'n awtomatic o'r teitl os nad ydych yn rhoi un i mewn. Mae llythrennau, rhifau, llinellau doriad, tanlinellau a blaensleisiau yn dderbyniol.

source: Use HTML editor?
cy_gb: Defnyddio golygydd HTML?

source: Check this to add an HTML editor bar for easily creating HTML. <strong>PHP code will not be read in pages if this option is checked.</strong>
cy_gb: Ticiwch yma i ychwanegu bar golygu HTML er mwyn hwyluso creu HTML. <strong>Ni fydd PHP yn cael ei ddarllen mewn tudalenau os nad yw'r opsiwn yma wedi'i ddewis.</strong>

source: Text
cy_gb: Testun

source: Add content for page, including HTML markup and PHP code (if the HTML editor is not checked above).
cy_gb: Ychwanegu cynnwys ar gyfer y tudalen, yn cynnwys HTML a chôd PHP (os nad yw'r golygydd HTML yn cael ei glicio uchod).

source: Parent
cy_gb: Rhiant

source: The parent page
cy_gb: Tudalen riant.

source: Order
cy_gb: Trefn

source: The order of the page relative to the other pages with the same parent
cy_gb: Trefn y tudalennau mewn perthynas a'r tudalennau eraill gyda'r un rhiant

source: Publish this page?
cy_gb: Cyhoeddi'r dudalen?

source: Checking this box will make the page public
cy_gb: Bydd ticio fan hyn yn gwneud y dudalen yn gyhoeddus.

source: The page "%s" has been added.
cy_gb: Ychwanegwyd y dudalen "%s".

source: The page "%s" has been edited.
cy_gb: Mae'r tudalen "%s" wedi cael ei addasu.

source: The page "%s" has been deleted.
cy_gb: Mae'r tudalen "%s" wedi ei ddileu.

source: Home
cy_gb: Adref

source: Main Page (No Parent)
cy_gb: Prif Dudalen (Dim Rhiant)

source: The page must be given a title.
cy_gb: Rhaid rhoi teitl i'r tudalen.

source: The title for your page must be 255 characters or less.
cy_gb: Rhaid i deitl y tudalen fod 255 nodyn neu lai.

source: The title is already in use by another page. Please choose another.
cy_gb: Mae'r teitl yma'n cael ei ddefnyddio gan dudalen arall. Dewis deitl gwahanol.

source: The page must be given a valid slug.
cy_gb: Rhaid i'r tudalen hon gael 'slug' dilys.

source: The slug for your page must not be a forward slash.
cy_gb: Ni all eich 'slug' gynnwys blaenslaes.

source: The slug for your page must be 255 characters or less.
cy_gb: Rhaid i 'slug' eich tudalen fod yn 255 nodyn neu lai.

source: The slug is already in use by another page. Please choose another.
cy_gb: Mae'r 'slug' yma'n cael ei ddefnyddio gan dudalen arall. Dewiswch 'slug' gwahanol.

source: The order must be an integer greater than or equal to 0.
cy_gb: Rhaid i'r drefn fod yn gyfanrif sy'n fwy neu'n hafal i 0.

source: Simple Pages | Add Page
cy_gb: Tudalennau Syml | Ychwanegu Tudalen

source: <strong>%1$s</strong> on %2$s
cy_gb: <strong>%1$s</strong> ar %2$s

source: Published
cy_gb: Wedi'i Gyhoeddi

source: Not Published
cy_gb: Heb ei Gyhoeddi

source: Last Modified
cy_gb: Dyddiad Addaswyd Ddiwethaf

source: Simple Pages | Browse
cy_gb: Tudalennau Syml | Pori

source: List View
cy_gb: Rhestr

source: Hierarchy View
cy_gb: Hierarchaeth

source: Add a Page
cy_gb: Ychwanegu Tudalen

source: There are no pages.
cy_gb: Does dim tudalennau.

source: Add a page.
cy_gb: Ychwanegu tudalen.

source: Simple Pages | Edit "%s"
cy_gb: Tudalennau Syml | Golygu "%s"

source: This page was created by <strong>%1$s</strong> on %2$s, and last modified by <strong>%3$s</strong> on %4$s.
cy_gb: Crewyd y dudalen hon gan <strong>%1$s</strong> ar %2$s, chafodd ei addasu ddiwethaf gan <strong>%3$s</strong> ar %4$s.
